#pragma once

// 最大３５文字
char Free[]       = "”ヤツ”は神出鬼没。油断しないでいこう\n一度行ったところも探索しよう";
char Count1[]     = "ドアの前でEnterを押すと入れる教室があるみたい...";
char Count2[]     = "さっきいた教室、単位があったような...";
char Count3[]     = "2Fの廊下が騒がしいみたいだ";
char Count4[]     = "廊下にも取りこぼした単位があるかもしれない。探そう。";
char Count5[]     = "なんだか噴水付近がさわがしいな";
char Count6[]     = "コンビニで物資を補給して校舎に戻ろう。";
char Count8[]     = "先輩が噴水のある中庭で単位を落としたって言ってたな。\n先に見つけて貰っていこう。";
char Count9[]     = "大通りで突然囲まれてクイズ大会になるって噂があったな...";
char Count10[]    = "そういえば草原で寝ていた先輩の単位はどうなったんだろう";
char Count12[]    = "ドリンクが切れそうだ！コンビニで補給して逃げよう！\nん？なんだかコンビニの奥が怪しいな";
char Count13[]    = "池の方を確認してみよう";
char Count14[]    = "逃げ切ろう！";
char Count15[]    = "探した場所以外の教室も漁ろう。";

char Quiz1[]      = "舞鶴高専には電子情報工学科が存在する。○か×か。";
char Quiz2[]      = "舞鶴高専の正式名称は舞鶴高等工業専門学校である";
char Quiz3[]      = "舞鶴高専にある学寮の規模は全国の高専でもトップクラスである";
char Quiz4[]      = "舞鶴高専は留年さえしなければ六学年制である";
char Quiz5[]      = "舞鶴高専に存在する学科の数は四つである";
char Choice[]     = "　　　　　　　　　　 ×(左←)                              ○(右→)";
char Corrects[]   = "　　　　　　　　　　　　　　　　 正解";
char Incorrects[] = "　　　　　　　　　　　　　　　　不正解";
char Next[]       = "                      ２秒後に次の問題が出題されます";
char Clear[]      = "                      全問正解！クイズを終了します";
char Quizfailure[]= "Enterを押して再挑戦！";

//ED

char ed1[]  = "MADE BY 芦鬼プロジェクト";
char ed2[]  = " ";
char ed3[]  = "リーダー プログラムetc担当               ２Ｅ 東口 富洋";
char ed4[]  = "鬼のビジュアル マップ画像担当            ２Ｓ 脇坂 将輝";
char ed5[]  = "マップ画像etc担当                       ２Ｓ 杉本 辞";
char ed6[] = "プログラムetc担当                       ２Ｓ 西保 洸太";
char ed7[] = "マップ画像etc担当                       ２Ｓ 林  倫太朗";
char ed8[]  = "マップ画像etc担当                       ２Ｓ 曽野 浩生";
char ed9[]  = "";
char ed10[] = "作成協力                    電気情報工学科 芦澤 恵太 教授";
